
# 使用帮助


helpDoc="
github储存库管理:

    [仓库名字 == holle ]

    ***************************

    创建公共储存库 
    --------------------------->
    gits -c hello 
    gits -c hello '仓库描述' 
    --------------------------->

    创建私有储存库
    --------------------------->
    gits -p hello 
    gits -p hello '仓库描述' 
    --------------------------->

    删除远程储存库
    --------------------------->
    gits -del hello 
    gits -del hello hello2 
    --------------------------->

    重命名存储库名
    --------------------------->
    gits -name hello hello2 
    --------------------------->

    查看所有储存库
    --------------------------->
    gits -l 
    --------------------------->

    查看所有储存库: 显示创建时间
    --------------------------->
    gits -ls 
    gits -ld
    --------------------------->

    查看所有储存库: 查看库类型、描述说明
    --------------------------->
    gits -ld 
    --------------------------->


    编辑所有储存库描述说明: 输出 description.md 文件进行修改
    --------------------------->
    gits -desf 
    --------------------------->


    更新所有储存库描述说明: 通过 description.md 文件进行更新描述
    --------------------------->
    gits -upDesf
    --------------------------->



    下载远程储存库中的文件
    --------------------------->
    gits -df hello test.txt 
    --------------------------->

    上传文件到远程储存库中
    --------------------------->
    gits -uf hello . [.|代表从本地仓库获取当前位置下的文件进行远程删除] 
    gits -uf hello test.txt 
    --------------------------->


    删除远程储存库中的文件: [*|删除仓库中所有文件]
    --------------------------->
    gits -delf hello * 
    gits -delf hello test.txt 
    --------------------------->


    下载远程储存库: gh
    --------------------------->
    gits -gh hello 
    gits -gh git@github.com:wangmings/wangmings.github.io.git 
    --------------------------->



    下载远程储存库: git
    --------------------------->
    gits -git hello 
    gits -git https://github.com/zhongyang219/TrafficMonitor  
    gits -git git@github.com:wangmings/wangmings.github.io.git 
    --------------------------->


    下载远程储存库: SSH代理下载
    --------------------------->
    gits -ssh hello 
    gits -ssh https://github.com/zhongyang219/TrafficMonitor  
    gits -ssh git@github.com:wangmings/wangmings.github.io.git 
    gits -ssh git clone https://github.com/electron/electron-quick-start 
    --------------------------->


    上传本地存储库到远程 
    [ 进入到项目下执行下面操作就可以把当前项目中所有文件上传到远程仓库 ]
    --------------------------->
    gits -up hello 
    --------------------------->


    查看、修改当前项目git配置
    --------------------------->
    gits -gu 
    --------------------------->


    查看、修改全局的git配置
    --------------------------->
    gits -gg 
    --------------------------->

    设置全局代理
    --------------------------->
    gits -g-s-proxy
    --------------------------->

    删除全局代理
    --------------------------->
    gits -g-d-proxy
    --------------------------->

    测速并更换GitHub的IP
    --------------------------->
    gits -sp 
    --------------------------->

    通过镜像网站访问github网站
    --------------------------->
    gits -url mdnice/markdown-nice   
    gits -url https://github.com/mdnice/markdown-nice   
    --------------------------->


    通过镜像网站访问自己的远程储存库
    --------------------------->
    # 访问终端仓库或者访问所有仓库
    gits -usr   
    gits -usr hello
    --------------------------->


    配置|查看|修改GitHub相关用户
    --------------------------->
    gits -fg   
    --------------------------->


    更新远程储存库的描述说明
    --------------------------->
    gits -des hello '这是我新建的一个仓库'   
    --------------------------->

    查看VPN网络代理是否启用
    --------------------------->
    gits -vpn 
    --------------------------->


    查看代理地址
    --------------------------->
    gits -AP   
    --------------------------->


    查看|设置|代理地址
    --------------------------->
    gits -SP   
    --------------------------->



"



helpDoc=$(echo -e "$helpDoc"|awk '{if($1=="gits") {print "\\e[32m" $0 "\\e[0m" }else{print $0}}')
printf "$helpDoc\n"



